Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memf.tmx
Source language: ca
Languages: es_es

source: Per tant, pot haver-hi documents que els buscadors no troben perquè mai no els han visitat.
es_es: Por lo tanto, puede haber documentos que los buscadores no encuentren porque nunca los han visitado.

source: (a): Un CD-ROM pot emmagatzemar 650 MB.
es_es: Un CD-ROM puede almacenar 650~MB.

source: Espanya
es_es: España

source: [Wi-Fi] (de l'anglés wireless fidelity, fidelitat sense fils): tecnologia de connexió sense fils (via ràdio), principalment per a formar xarxes locals, que pot arribar fins als 54 Mbps de velocitat de transmissió.
es_es: tecnología de conexión inalámbrica (vía radio), principalmente para formar redes locales, que puede llegar hasta los 54 Mbps de velocidad de transmisión.

source: Un carácter, en les codificacions usades comunament en Europa occidental, ocupa un octet; per tant, la pàgina de $50 60$ ocupa 3.000 octets.
es_es: Un carácter, en las codificaciones usadas comúnmente en Europa occidental, ocupa un byte;

source: De fet, aquestes notes es poden millorar molt, i anirem fent versions noves.
es_es: De hecho, estas notas se pueden mejorar mucho, e iremos haciendo versiones nuevas.

source: La taula dóna alguns exemples d'indicatius de països.
es_es: La tabla da algunos ejemplos de indicativos de países.

source: [3.] Si no existeix la posició $p$ de $B$, vés a 8.
es_es: [3.] Si no existe la posición $p$ de $B$, ve a 8.

source: Només si es tracta del directori arrel.
es_es: \item Sólo si se trata del directorio raíz.

source: Cada una de les ordres es correspon amb una instrucció bàsica de les que pot entendre qualsevol processador.
es_es: Cada una de las órdenes se corresponde con una instrucción básica de las que puede entender cualquier procesador.

source: Cada número del 0 al 255 es pot emmagatzemar en 8 bits ($2^8=256$) i n'hi ha quatre: $8 4=32$.
es_es: Cada número del 0 al 255 se puede almacenar en 8 bits ($2^8=256$) y hay cuatro: $8 4=32$.

source: { func compara(A, B : sequencia de car); var p : entera ; etiquetes : 2 ; inici p:=1; 2: si A[p]<>B[p] llavors retorna 'no'; si A[p]='\$' llavors retorna 'si' p:=p+1; vesa 2; fi; }
es_es: { func compara(A, B : secuencia de car); var p : entera ; etiquetas : 2 ; inicio p:=1; 2: si A[p]<>B[p] entonces vuelve 'no'; si A[p]='\$' entonces vuelve 'si' p:=p+1; vesa 2; fi; }

source: Els serveis i els documents concrets presents en un ordinador que els fa disponibles (un servidor d'Internet) es poden designar mitjançant el seu identificador uniforme de recursos o, més comunament, URI (de l'anglés uniform resource identifier). L'URI és, per tant, una adreça que identifica o localitza uniformement un servei o document (un recurs) de qualsevol dels que s'ofereixen en Internet.
es_es: Hasta hace poco la denominación usual era URL, uniform resource locator o localizador uniforme de recursos, que todavía se usa muy a menudo.

source: Noms
es_es: Nombres

source: Normalment els algorismes especifiquen un mètode general per a obtenir la resposta (correcta o incorrecta) a qualsevol cas particular d'un problema o pregunta, com ara ``quin és el quocient de la divisió de dos nombres enters''?
es_es: Normalmente los algoritmos especifican un método general para obtener la respuesta (correcta o incorrecta) a cualquier caso particular de un problema o pregunta, como por ejemplo "¿cuál es el cociente de la división de dos números enteros?''

source: Una targeta de comunicacions (mòdem o targeta de xarxa, amb fils o sense fils vegeu el glossari, apartat ).
es_es: Una tarjeta de comunicaciones (módem o tarjeta de red, sea o no inalámbrica ver el glosario, apartado ).

source: Tipus d'ordinadors
es_es: Tipos de ordenador

source: [Programes d'aplicació:] (de vegades s'anomenen simplement { aplicacions}) Programari dissenyat específicament per a satisfer les necessitats dels usuaris.
es_es: [Programas de aplicación:] (a veces se denominan simplemente { aplicaciones}) Software diseñado específicamente para satisfacer las necesidades de los usuarios.

source: Se'n podrien fer dos grups: [Programari d'ús específic:] Programari dissenyat per a un usuari molt concret amb unes necessitats molt concretes: per exemple, el programa que gestiona els préstecs, les quotes i les adquisicions d'un videoclub, fet a mida per a ell.
es_es: Se podrían hacer dos grupos: [Software de uso específico:] Software diseñado para un usuario muy concreto con unas necesidades muy concretas: por ejemplo, el programa que gestiona los préstamos, las cuotas y las adquisiciones de un videoclub, hecho a medida para él.

source: [Linux:] un sistema operatiu multitasca i multiusuari gratuït, de l'estil de l'Unix que es podia trobar en els miniordinadors, desenvolupat de manera no lucrativa per milers de voluntaris arreu del món i que es pot copiar lliurement complint certes condicions.
es_es: [Linux:] un sistema operativo multitarea gratuito, del estilo del Unix que se podía encontrar en los miniordenadores, desarrollado de manera no lucrativa por miles de voluntarios en el mundo y que se puede copiar libremente cumpliendo ciertas condiciones.

source: Com que recordar números IP no és fàcil, normalment s'usen noms o adreces per a referir-se a les màquines; alguns dels ordinadors de la xarxa (anomenats servidors de noms) s'encarreguen de traduir els noms a números IP.
es_es: Como recordar números IP no es fácil, normalmente se usan nombres o direcciones para referirse a las máquinas; algunos de los ordenadores de la red (llamados servidores de nombres) se encargan de traducir los nombres a números IP.

source: Aquestes diferències eren degudes al fet que el processador del Mac no era de la família 86 (386, 486, Pentium) d'Intel, sinó d'una altra (antigament la família 68000 de Motorola, i després l'anomenat PowerPC).
es_es: Estas diferencias se debían al hecho de que el procesador del Mac no era de la familia 86 (386, 486, Pentium) de Intel, sino de otra (antiguamente la familia 68000 de Motorola, y después del llamado PowerPC).

source: [Programes d'autopublicació o autoedició,] que integren textos, imatges, etc.
es_es: [Programas de autopublicación y autoedición,] que integran textos, imágenes, etc.

source: [USB] (de l'anglés universal serial bus, bus sèrie universal): Estàndard o norma de connexió de dispositius perifèrics (impressores, mòdems, reproductors digitals de música, càmeres digitals, unitats de memòria) que transmet les dades en sèrie (és a dir, un bit darrere de l'altre) a velocitats que poden arribar als 12 Mbps, i que permet la connexió i desconnexió de dispositius ``en calent'', és a dir, sense haver d'apagar l'ordinador.
es_es: Estándar o norma de conexión de dispositivos periféricos (impresoras, módems, reproductores digitales de música, cámaras digitales, unidades de memoria) que transmite los datos en serie (es decir, un bit detrás de otro) a velocidades que pueden llegar a los 12 Mbps, y que permite la conexión y desconexión de dispositivos "en caliente'', es decir, sin tener que apagar el ordenador.

source: També anomenats documents o arxius.
es_es: También llamados documentos o archivos.

source: Algunes de les operacions bàsiques que fan els sistemes operatius són: Controlar el maquinari de l'ordinador on s'executen.
es_es: Algunas de las operaciones básicas que hacen los sistemas operativos son: Controlar el hardware del ordenador donde se ejecutan.

source: Els mòdems serveixen per a connectar-nos a Internet, per exemple, usant la línia telèfonica.
es_es: \item Los módems sirven para conectarnos en Internet, por ejemplo, usando la línea telefónica.

source: (c).
es_es: \item (c).

source: Actualment no és estrany que una unitat de CD-ROM tinga una velocitat punta de lectura i d'escriptura de 52$$ o més.
es_es: Actualmente no es extraño que una unidad de CD-ROM tenga una velocidad punta de lectura y de escritura de 52$$ o más.

source: [Processadors de llenguatges de programació:] les instruccions que executa el processador central d'un ordinador són massa senzilles perquè un programador humà en faça programes útils; seria llarg i enutjós, com hem vist en l'exemple de programa que sumava els enters de l'1 al 10.
es_es: [Procesadores de lenguajes de programación:] las instrucciones que ejecuta el procesador central de un ordenador son demasiado sencillas para que un programador humano haga programas útiles; sería largo y engorroso, como hemos visto en el ejemplo de programa que sumaba los enteros del 1 al 10.

source: Internet (vegeu el capítol ) no és més que una gran xarxa global que interconnecta moltes xarxes més locals.
es_es: Internet (ver el capítulo ) no es más que una gran red global que interconecta muchas redes más locales.

source: L'ús de la paraula programa en informàtica (seqüència d'operacions o esdeveniments) és paral·lel a molts usos d'aquest mot en la vida quotidiana: programa de festes, d'un concert, de la llavadora, etc.; encara que per a la persona usuària un programa d'ordinador és més similar a una espècie de caixa d'eines per a fer una tasca determinada, com, per exemple, editar un document de text.
es_es: El uso de la palabra programa en informática (secuencia de operaciones o acontecimientos) es paralelo a muchos usos de esta palabra en la vida cotidiana: programa de fiestas, de un concierto, de la lavadora, etc.; aunque para la persona usuaria un programa de ordenador es más similar a una especie de caja de herramientas para hacer una tarea determinada, como, por ejemplo, editar un documento de texto.

source: [4.] Suma 1 a p. [5.] Vés al pas 2.
es_es: [4.] Suma 1 a p. [5.] Ve al paso 2.

source: Quant es tarda aproximadament en enviar a través d'una connexió via mòdem de 28800 bits per segon el contingut d'un disquet de densitat alta de 3 polzades i mitja completament ple?
es_es: \item ¿Cuánto se tarda aproximadamente en enviar a través de una conexión vía módem de 28800 bits por segundo el contenido de un disquete de alta densidad de 3 pulgadas y media completamente lleno?

source: {} associar-los el programa que els obrirà quan fem doble clic sobre la icona del fitxer.
es_es: \begin{enumerate} \item {\ldots} asociarlos al programa que los abrirá cuando hagamos doble clic sobre el icono del fichero.

source: [Eixida:] Aquesta és la família dels dispositius que l'ordinador usa per a comunicar dades o informació a l'usuari.
es_es: [Salida:] Ésta es la familia de los dispositivos que el ordenador usa para comunicar datos o información al usuario.

source: No, perquè no hi cap.
es_es: \item No, porque no cabe.

source: (a) (b) (a) (a): Cada punt pot prendre un de 256 colors.
es_es: Cada punto puede tomar uno de los 256 colores.

source: [GHz:] vegeu gigahertz.
es_es: [GHz:] ver gigaherzio.

source: Però, el seu volum reduït limita les possibilitats de fer-hi ampliacions i, per tant, el seu temps de vida és sovint més curt que el dels ordinadors de sobretaula.
es_es: Pero, su reducido volumen limita las posibilidades de hacer ampliaciones y, por lo tanto, su tiempo de vida es a menudo más corto que el de los ordenadores de sobremesa.

source: Que s'execute indefinidament.
es_es: \item Que se ejecute indefinidamente.

source: el directori on es troba el servei.
es_es: el directorio donde se encuentra el servicio.

source: Un disquet no pot contenir més de dos nivells jeràrquics de carpetes.
es_es: \item Un disquete no puede contener más de dos niveles jerárquicos de carpetas.

source: Per a poder accedir a Internet d'aquesta manera des de casa, cal: un mòdem un programa per a l'accés telefònic a xarxes (normalment present en el sistema operatiu) haver-se donat d'alta amb algun proveïdor d'Internet (ISP, Internet service provider) El proveïdor d'Internet sol estar accessible mitjançant un número de telèfon, que a Espanya comença normalment per 908 o 909, a França per comença per 0860 i a Itàlia per 70, i és similar a un número local.
es_es: De este modo, para poder acceder a Internet desde casa, hace falta: un módem un programa que se usa para el acceso telefónico en redes (normalmente presente en el sistema operativo) haberse dado de alta con algún proveedor de Internet (ISP, Internet service provider) El proveedor de Internet suele estar accesible mediante un número de teléfono, que en España empieza normalmente por 908 o 909, en Francia por ejemplo, empieza por 0860 y en Italia por 70, y es similar, a un número local.

source: La seqüència dels noms de les carpetes que cal anar obrint fins que arribem a un fitxer s'anomena la trajectòria o la ruta del fitxer.
es_es: La secuencia de los nombres de las carpetas que hay que ir abriendo hasta que lleguemos a un fichero se llama la trayectoria o la ruta del fichero.

source: Una classificació no gaire exhaustiva dels diferents tipus d'ordinadors que podem trobar-nos avui dia és la següent:
es_es: A continuación tenemos una clasificación no muy exhaustiva de los diferentes tipos de ordenadores que podemos encontrarnos actualmente:

source: Els DVD actuals contenen uns 4,7 GB, però ja s'han devolupat tècniques que n'amplien considerablement la capacitat.
es_es: Los DVDs actuales contienen unos 4,7 GB, pero ya se han desarrollado técnicas que amplican considerablemente su capacidad.

source: L'esquema { https://} és similar a l'esquema { http://} però incorpora, a més, mecanismes per a transmetre amb seguretat informació encriptada (xifrada).
es_es: El esquema { https://} es similar al esquema { http://} pero incorpora, además, mecanismos para transmitir con seguridad información encriptada (cifrada).

source: És lenta, volàtil i d'accés aleatori.
es_es: \item Es rápida, volátil y de acceso aleatorio.

source: En el cas del mòdem més comú, el mòdem telefònic, es tracta d'un dispositiu (normalment una placa interna, encara que també pot ser extern) que permet usar la línia telefònica (senyals analògics) per a comunicacions informàtiques (digitals) entre dos ordinadors.
es_es: En el caso del módem más común, el módem telefónico, se trata de un dispositivo (normalmente una placa interna, aunque también puede ser externa) que permite usar la línea telefónica (señales analógicas) para comunicaciones informáticas (digitales) entre dos ordenadores.

source: Fa uns anys havia diferències significatives entre els PC i els Mac de manera que no eren compatibles, es a dir, que els programes d'un no funcionaven en l'altre, s'havien d'adaptar a les característiques particulars de cadascun.
es_es: Hace unos años había diferencias significativas entre los PC y los Mac de manera que no eran compatibles, es decir, que los programas de uno no funcionaban en el otro, tenían que adaptarse a las características particulares de cada uno.

source: Cada punt d'una pantalla pot tenir 256 colors: quants octets (bytes) de memòria ocupa cada punt?
es_es: cuántos (\emph{bytes}) de memoria ocupa cada punto?

source: Quin dels tres mitjans d'emmagatzemament següents no és magnètic: Un CD-ROM Un disquet flexible Un disc fix Quina capacitat (aproximada) té un disquet de 3,5 polzades de densitat alta?
es_es: \item Cuál de los tres medios de almacenamiento siguientes no es magnético: \begin{enumerate} \item Un CD-ROM \item Un disquete \item Un disco fijo \end{enumerate} \item ¿Qué capacidad (aproximada) tiene un disquete de 3,5 pulgadas de alta densidad?

source: El programa de dalt tindria l'aparença següent: mov #1,A mov A,index mov #0,A mov A,suma altre: mov suma,A add A,index mov A,suma mov index,A cmp A,#10 jeq final inc A mov A,index jmp altre final: hlt
es_es: El programa de arriba tendría la apariencia siguiente: mov #1,A mov A,index mov #0,A mov A,suma otro: mov suma,A add A,index mov A,suma mov index,A cmp A,#10 jeq final inc A mov A,index jmp otro final: hlt

source: Sí, instal·lant-li un mòdem a la impressora.
es_es: \item Sí, instalándole un módem a la impresora.

source: El preu per a una connexió de 600 kbps està també al voltant dels 39 euros.
es_es: El precio por una conexión de 600 kbps está también alrededor de los 39 euros.

source: } Aquest algorisme es pot convertir a un programa d'ordinador.
es_es: } Este algoritmo se puede convertir en un programa de ordenador.

source: [densitat alta:] Quan els disquets de 3 polzades i mitja (uns 90 mm) són de densitat alta solen estar marcats amb les lletres HD (high density) i poden emmagatzemar 1,44 MB de dades.
es_es: [densidad alta:] Cuando los disquets de 3 pulgadas y media (unos 90 mm) son de densidad alta suelen estar marcados con las letras HD (high density) y pueden almacenar 1,44 MB de datos.

source: De tota manera, les velocitats mitjanes de tot un procés de lectura i escriptura solen ser més baixes.
es_es: De todas maneras, las velocidades medianas de todo un proceso de lectura y escritura suelen ser más bajas.

source: La memòria RAM Un CD-ROM Un disquet Tenim dues unitats lectores de CD-ROM.
es_es: \begin{enumerate} \item La memoria RAM \item Un CD-ROM \item Un disquete \end{enumerate} \item Tenemos dos unidades lectoras de CD-ROM.

source: Es distingeixen perquè els primers tenen un petit foradet quadrat addicional (a la part inferior dreta si posem la finestra dalt).
es_es: Se distinguen porque los primeros tienen un pequeño agujero cuadrado adicional (en la parte inferior derecha si ponemos la ventana arriba).

source: Per exemple, Internet permet que els professionals puguen usar recursos remots, o que puguen rebre originals dels seus clients i remetre'ls-en les traduccions.
es_es: Por ejemplo, Internet permite que los profesionales puedan usar recursos remotos, o que puedan recibir originales de sus clientes y remitirlos en las traducciones.

source: Tres bits per dígit decimal no són suficients (permeten només 8 combinacions); quatre, sí.
es_es: Tres bits por dígito decimal no son suficientes (permiten sólo 8 combinaciones); cuatro, sí.

source: La raó d'aquest nom és l'oposició entre accés aleatori (random, a voluntat) i accés seqüencial; per exemple, a les dades enregistrades en una cinta magnètica ---com, per exemple, la d'una casset--- només es pot accedir seqüencialment: per a arribar a la dada número 1000 hem de passar per les 999 anteriors.
es_es: La razón de este nombre es la oposición entre acceso aleatorio (random, a voluntad) y acceso secuencial; por ejemplo, a los datos grabados en una cinta magnética ---como, por ejemplo, la de una casete--- sólo se puede acceder secuencialmente: para llegar al dato número 1000 tenemos que pasar por las 999 anteriores.

source: Tots els sistemes informàtics tenen maquinari de les classes següents:
es_es: Todos los sistemas informáticos tienen hardware de las clases siguientes:

source: Una velocitat clàssica en mòdems domèstics és 33.600 bps (més recentment, 57.600 bps; les línies telefòniques actuals poden admetre potser velocitats al voltant dels 100.000 bps).
es_es: Una velocidad clásica en módems domésticos es 33.600 bps (más recientemente, 57.600 bps; las líneas telefónicas actuales pueden admitir tal vez velocidades alrededor de los 100.000 bps).

source: Per això, quan s'especifiquen les característiques d'un programa d'ordinador s'ha de dir per a quin sistema operatiu està escrit, ja que cada sistema operatiu ofereix serveis diferents i interacciona de manera diferent amb els programes d'aplicació.
es_es: Por eso, cuando se especifican las características de un programa de ordenador se tiene que decir para qué sistema operativo está escrito, puesto que cada sistema operativo ofrece servicios diferentes e interacciona de manera diferente con los programas de aplicación.

source: Són, amb diferència, els ordinadors més habituals.
es_es: Son, con diferencia, los ordenadores más habituales.

source: Si assignem un número a cada alumne, quants octets (bytes) fan falta per a guardar el número de cada alumne?
es_es: Si asignamos un número a cada alumno, ¿cuántos (\emph{bytes}) hacen falta para guardar el número de cada alumno?

source: [Programari] (o software): un o més programes (i les dades associades) que fan alguna funció útil.
es_es: Software): uno o más programas (y los datos asociados) que hacen alguna función útil.

source: Es diu que els ordinadors d'Internet formen una xarxa, en la qual els nodes o nusos són els ordinadors i els fils, les connexions; les connexions poden ser de naturalesa molt diversa (línies telefòniques, fibra òptica, enllaços de ràdio terrestres o per satèl·lit, etc.), però el protocol d'Internet està dissenyat de manera que la naturalesa de la connexió no siga rellevant per a l'usuari.
es_es: Se dice que los ordenadores de Internet forman una red, en la cual los nudos son los ordenadores y los hilos, las conexiones; las conexiones pueden ser de naturaleza muy diversa (líneas telefónicas, fibra óptica, enlaces de radio terrestre o satélite, etc.), pero el protocolo de Internet está diseñado de forma que la naturaleza de la conexión no sea relevante para el usuario.

source: Establir connexions entre ordinadors.
es_es: Establecer conexiones entre ordenadores.

source: Crear, moure i esborrar directoris de fitxers.
es_es: Crear, mover y borrar directorios de ficheros.

source: (Windows, Macintosh OS, OS/2) i de { línia d'ordres}, és a dir, basats en text (Unix primigeni, VAX/VMS, MS-DOS).
es_es: (Windows, Macintosh OS, OS/2) y de { línea de órdenes}, es decir, basados en texto (Unix primigenio, VAX/VMS, MS-DOS).

source: Guarda el valor de l'acumulador en una posició de memòria que anomenarem índex.
es_es: Guarda el valor del acumulador en una posición de memoria que denominaremos índice.

source: el nom del servidor.
es_es: el nombre del servidor.

source: Un dels recursos d'Internet més útils són els buscadors o cercadors.
es_es: Uno de los recursos de Internet más útiles son los metabuscadores o buscadores.

source: Normalment, cada disc té un { directori principal} o directori arrel (el més elevat en la jerarquia de directoris), dins del qual es troba tota la resta de directoris.
es_es: Normalmente, cada disco tiene un { directorio principal} o directorio raíz (el más elevado en la jerarquía de directorios), dentro del cual se encuentran el resto de directorios.

source: Per exemple, en un ordinador amb 512 kilooctets (524.288 octets) de memòria cau, després d'accedir a la posició 2.000.000 és molt probable que el processador vulga accedir a la posició 2.000.003.
es_es: Por ejemplo, en un ordenador con 512 kilobytes (524.288 bites) de memoria caché, después de acceder a la posición 2.000.000 es muy probable que el procesador quiera acceder a la posición 2.000.003.

source: No se'n pot dir res: els números IP poden no tenir res a veure.
es_es: No se puede decir nada: los números IP pueden no tener nada que ver.

source: Quants bits són necessaris per a emmagatzemar-los?
es_es: ¿Cuántos bits son necesarios para almacenarlos?

source: Exemples: disquets, discos fixos o durs, unitats de cinta, memòries USB (també anomenades llàpis o pendrive) i diverses formes de ROM (read-only memory, memòria de lectura només), com els xips ROM o el CD-ROM.
es_es: Ejemplos: disquetes, discos fijos o duros, unidades de cinta, memorias USB (también llamadas lápices o pendrives) y varias formas de ROM (read-only memory, memoria sólo de lectura), como los chips ROM o el CD-ROM.

source: 1 megaoctet (megabyte) 384 kilooctets (kilobytes) 8 megaoctets (megabytes)
es_es: \begin{enumerate} \item 1 (\emph{megabyte}) \item 384 (\emph{kilobytes}) \item 8 (\emph{megabytes}) \end{enumerate}
